Ran Plan for project: `test-atlantis` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Starting setup
Completed 207 Bytes/207 Bytes (1.9 KiB/s) with 1 file(s) remainingdownload: s3://fcp-frontend/atlantis/common.tfvars to ./common.tfvars
# Default provider representing destination account
provider "aws" {
  region = "${var.provider_region}"
  assume_role {
    role_arn     = "${var.role_arn}"
    session_name = "test-atlantis"
  }
}

#Provider representing atlantis server account
provider "aws" {
  alias  = "atlantis"
  region    = "${var.provider_region}"
}

terraform {
  backend "s3" {
    bucket = "fcp-staging-customer"
    key    = "test-atlantis/terraform.tfstate"
    region = "us-east-1"
    role_arn = "arn:aws:iam::910176200576:role/fcp-staging-customer-assume-role"
  }
}

resource "aws_instance" "test-atlantis" {
  ami           = "ami-087c17d1fe0178315"
  instance_type = "c5.large"
  subnet_id = "subnet-0179cd952bf0953ad"

  tags = {
    Name = var.instance_name,
    Type = var.type_name,
    Owner = var.owner_name
  }
}Finished setup


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.test-atlantis will be created
+ resource "aws_instance" "test-atlantis" {
      + ami                                  = "ami-087c17d1fe0178315"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "c5.large"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0179cd952bf0953ad"
      + tags                                 = {
          + "Name"  = "test-tfvars"
          + "Owner" = "ganesh.katakam@freshworks.com"
          + "Type"  = "Development"
        }
      + tags_all                             = {
          + "Name"  = "test-tfvars"
          + "Owner" = "ganesh.katakam@freshworks.com"
          + "Type"  = "Development"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ ec2_instanceId = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p test-atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-79dfb6dbd6-sfq49:4141/lock?id=ganesh-katakam-T18451%252Ftest-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p test-atlantis`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
